{
    "intents": [
        {
            "tag": "greeting",
            "patterns": [
                "Hi",
                "Hello",
                "Hey",
                "Good morning",
                "Good afternoon",
                "Good evening",
                "Hi there",
                "Hello there"
            ],
            "responses": [
                "Hello! How can I assist you with your furniture needs today?",
                "Hi there! How can I help you find the perfect furniture?",
                "Hey! Looking for something specific in furniture?",
                "Good day! How can I support your furniture shopping?",
                "Hello! How can I help you today?",
                "Hi! What can I do for you regarding our furniture?",
                "Hey there! Need help with furniture?",
                "Hello! What furniture are you looking for today?"
            ]
        },
        {
            "tag": "farewell",
            "patterns": [
                "Bye",
                "Goodbye",
                "See you later",
                "Take care",
                "Farewell",
                "Catch you later",
                "Talk to you later"
            ],
            "responses": [
                "Goodbye! Have a great day!",
                "See you later! Let us know if you need any more furniture help!",
                "Bye! Don't hesitate to ask if you need more information.",
                "Take care! Come back soon for more furniture deals!",
                "Farewell! Have a wonderful day!",
                "Catch you later! We're here if you need more assistance.",
                "Talk to you later! Feel free to reach out anytime."
            ]
        },
        {
            "tag": "thanks",
            "patterns": [
                "Thank you",
                "Thanks",
                "I appreciate it",
                "Thank you so much",
                "Thanks a lot",
                "Many thanks",
                "Thank you very much"
            ],
            "responses": [
                "You're welcome!",
                "No problem! Happy to help with your furniture needs.",
                "You're welcome! Is there anything else you need?",
                "Glad to assist! Let me know if you have more questions.",
                "You're welcome! Anytime you need help, I'm here.",
                "No worries! I'm here to help.",
                "You're welcome! Do you need help with anything else?"
            ]
        },
        {
            "tag": "product_inquiry",
            "patterns": [
                "Tell me about the [product_name]",
                "What is the price of [product_name]?",
                "Do you have [product_name] in stock?",
                "I need details about [product_name]",
                "Can you provide information on [product_name]?",
                "What are the features of [product_name]?",
                "How much does [product_name] cost?",
                "Is [product_name] available?",
                "Give me some details on [product_name]",
                "Describe the [product_name]",
                "Show me [product_name]",
                "Information on [product_name]",
                "Specifications of [product_name]",
                "What is [product_name] made of?",
                "Is [product_name] durable?",
                "Can I see pictures of [product_name]?"
            ],
            "responses": [
                "[product_name] is a high-quality item available for $[price]. It features [product_features].",
                "[product_name] costs $[price] and is currently in stock.",
                "Yes, we have [product_name] available. It's priced at $[price] and includes [product_features].",
                "[product_name] is priced at $[price]. Here are some details: [product_features].",
                "[product_name] is available for $[price]. It comes with [product_features].",
                "You can get [product_name] for $[price]. It includes the following features: [product_features].",
                "The price of [product_name] is $[price], and it is currently in stock with these features: [product_features].",
                "Currently, [product_name] is available and priced at $[price]. It has the following features: [product_features].",
                "[product_name] has the following features: [product_features]. It is available for $[price].",
                "[product_name] is available. It costs $[price] and includes features like [product_features].",
                "[product_name] is made from [materials]. It costs $[price] and has these features: [product_features].",
                "For $[price], you can get [product_name] which includes [product_features].",
                "[product_name] includes [product_features] and is priced at $[price].",
                "[product_name] is a durable product made of [materials] and priced at $[price].",
                "You can see pictures of [product_name] on our product page. It is priced at $[price] and features [product_features]."
            ]
        },
        {
            "tag": "order_status",
            "patterns": [
                "Where is my order?",
                "Can you tell me the status of my order?",
                "I want to track my order",
                "Order status for order number [order_number]",
                "What's the status of my order?",
                "Can I track my order?",
                "How can I check my order status?",
                "Tell me the status of order [order_number]",
                "Track my order",
                "Order tracking for [order_number]",
                "When will my order arrive?",
                "How long until my order gets here?",
                "I need to track my order",
                "Status of my order",
                "What is the current status of my order?",
                "Is my order on the way?",
                "Has my order shipped?"
            ],
            "responses": [
                "Your order is currently [order_status]. You can expect delivery by [delivery_date].",
                "Order number [order_number] is [order_status]. Tracking details have been sent to your email.",
                "Your order is [order_status] and should arrive by [delivery_date].",
                "Order [order_number] is [order_status]. You can track it using the tracking number provided.",
                "The status of your order is [order_status]. It should reach you by [delivery_date].",
                "Your order [order_number] is currently [order_status]. Expected delivery date is [delivery_date].",
                "Order [order_number] status is [order_status]. Check your email for tracking details.",
                "Your order is [order_status] and will be delivered by [delivery_date].",
                "Your order has been shipped and is on the way. Expected delivery is by [delivery_date].",
                "Order [order_number] is on the way and will arrive by [delivery_date].",
                "Your order is in transit and expected to be delivered by [delivery_date].",
                "Order [order_number] is in processing and will ship soon. Expected delivery is [delivery_date].",
                "The order [order_number] has been dispatched and will arrive by [delivery_date].",
                "Your order is currently being processed and should ship soon. Expected delivery date is [delivery_date].",
                "The status of order [order_number] is [order_status]. It should be delivered by [delivery_date].",
                "Order [order_number] is [order_status] and on track for delivery by [delivery_date]."
            ]
        },
        {
            "tag": "shipping_info",
            "patterns": [
                "What are your shipping options?",
                "Do you offer free shipping?",
                "How long does shipping take?",
                "Tell me about your shipping policies",
                "What are the shipping charges?",
                "How much is shipping?",
                "What is your shipping policy?",
                "Do you ship to [location]?",
                "Shipping options available",
                "Cost of shipping",
                "Free shipping details",
                "Shipping duration",
                "How fast is shipping?",
                "Shipping rates",
                "Do you ship internationally?",
                "International shipping options",
                "How do you ship your products?",
                "Which courier do you use for shipping?",
                "Can I choose the shipping method?",
                "What courier services do you use?"
            ],
            "responses": [
                "We offer various shipping options including standard, expedited, and overnight shipping.",
                "Yes, we offer free shipping on orders over $[amount].",
                "Standard shipping takes [shipping_time] days, while expedited shipping takes [expedited_time] days.",
                "Our shipping policies include options for standard, expedited, and overnight shipping. Free shipping is available for orders over $[amount].",
                "Shipping charges vary based on the shipping method selected. Free shipping is available for orders over $[amount].",
                "We have different shipping rates based on the delivery speed. Free shipping applies to orders over $[amount].",
                "Our shipping policy covers standard, expedited, and overnight shipping. Free shipping is available for purchases over $[amount].",
                "We do ship to [location]. Delivery times and charges vary based on the shipping method selected.",
                "Shipping to [location] is available. Rates and delivery times depend on the shipping method.",
                "We offer free shipping on orders over $[amount]. For other orders, shipping charges apply based on the method chosen.",
                "Standard shipping takes [shipping_time] days, while faster options are available at an additional cost.",
                "We provide shipping to various locations. Delivery time depends on the chosen shipping method.",
                "Free shipping is available for orders above $[amount]. Other shipping options come with varying costs and delivery times.",
                "Our shipping rates depend on the delivery speed and location. Free shipping is available on qualifying orders.",
                "International shipping is available. Delivery times and rates vary based on the destination and shipping method.",
                "We offer international shipping with delivery times and charges varying by location.",
                "Products are shipped using reliable couriers. Shipping times vary based on the chosen method.",
                "We use trusted courier services for shipping. You can select the shipping method during checkout.",
                "You can choose from different shipping methods, including standard, expedited, and overnight options.",
                "We use various courier services to ensure timely delivery. You can select the shipping method at checkout."
            ]
        },
        {
            "tag": "return_policy",
            "patterns": [
                "What is your return policy?",
                "Can I return a product?",
                "How do I return an item?",
                "What are the conditions for returns?",
                "What is your refund policy?",
                "Can I get a refund?",
                "How can I return a purchase?",
                "What is the process for returns?",
                "Return policy details",
                "How to process a return",
                "Conditions for returning items",
                "Refund conditions",
                "Returning a product",
                "Return process",
                "Return",
                "Can I exchange an item?",
                "Exchange policy",
                "How to return a defective item?",
                "Returning a damaged product",
                "Refund for a returned item",
                "What are the terms for returns?"
            ],
            "responses": [
                "You can return items within 30 days of delivery for a full refund.",
                "To return a product, please visit our returns page and follow the instructions.",
                "Our return policy allows for returns within 30 days. Items must be in original condition.",
                "Returns are accepted within 30 days. Items should be unused and in original packaging.",
                "You can get a refund if you return the item within 30 days in its original condition.",
                "We accept returns within 30 days. Items should be in unused and original condition for a full refund.",
                "Our refund policy states that items can be returned within 30 days for a full refund if they are in their original condition.",
                "The process for returns includes visiting our returns page and following the provided instructions. Returns are accepted within [return_period] days.",
                "Items can be returned within 30 days of delivery for a refund. Please ensure they are in original condition.",
                "To return an item, please follow the steps on our returns page. Returns are accepted within [return_period] days.",
                "Our return policy covers returns within 30 days. Items must be returned in original condition for a refund.",
                "You can return items for a full refund within 30 days. Please ensure the items are unused and in their original packaging.",
                "Refunds are processed for items returned within 30 days in original condition.",
                "To exchange an item, please initiate the return process within 30 days and specify the exchange request.",
                "Our exchange policy allows exchanges within 30 days, provided the items are in original condition.",
                "Defective items can be returned within 30 days. Please contact customer service for assistance.",
                "If you receive a damaged product, you can return it within 30 days for a replacement or refund.",
                "Refunds for returned items are processed once we receive and inspect the returned products.",
                "Returns are accepted within 30 days. Items must be in original, unused condition for a refund or exchange."
            ]
        },
        {
            "tag": "payment_methods",
            "patterns": [
                "What payment methods do you accept?",
                "Can I pay with PayPal?",
                "Do you accept credit cards?",
                "How can I pay for my order?",
                "What are your payment options?",
                "Can I use a debit card?",
                "Do you accept online payments?",
                "What forms of payment do you take?",
                "Payment methods available",
                "Credit card payment",
                "Paying with debit card",
                "Do you accept bank transfers?",
                "Can I pay using mobile payment?",
                "What online payment options are there?",
                "Is PayPal accepted?",
                "Which credit cards do you accept?",
                "Can I pay by bank transfer?",
                "Mobile payment options",
                "What payment methods are supported?",
                "Accepted forms of payment"
            ],
            "responses": [
                "We accept various payment methods including credit cards, PayPal, and bank transfers.",
                "Yes, you can pay with PayPal.",
                "We accept all major credit cards including Visa, MasterCard, and American Express.",
                "You can pay for your order using credit cards, PayPal, or bank transfers.",
                "Our payment options include credit cards, PayPal, and bank transfers.",
                "Yes, debit cards are also accepted.",
                "We accept online payments through credit cards, PayPal, and bank transfers.",
                "You can use credit cards, debit cards, PayPal, and bank transfers to make a payment.",
                "Payment methods available include credit cards, debit cards, PayPal, and bank transfers.",
                "We accept credit card payments. Major cards like Visa, MasterCard, and American Express are accepted.",
                "You can pay using a debit card as well.",
                "Bank transfers are accepted as a payment method.",
                "We support mobile payment options for your convenience.",
                "Online payment options include credit cards, PayPal, and bank transfers.",
                "PayPal is accepted for online payments.",
                "We accept various credit cards, including Visa, MasterCard, and American Express.",
                "Yes, you can pay by bank transfer.",
                "Mobile payment options are available for ease of use.",
                "We support multiple payment methods including credit cards, PayPal, debit cards, and bank transfers.",
                "Accepted forms of payment include credit cards, debit cards, PayPal, and bank transfers."
            ]
        },
        {
            "tag": "customer_support",
            "patterns": [
                "I need help with my order",
                "Can you assist me?",
                "I have a problem with my purchase",
                "Support",
                "Customer service",
                "I need assistance",
                "Can you help me?",
                "I have an issue with my order",
                "Help with order",
                "Problem with my purchase",
                "I need customer service",
                "Can you provide assistance?",
                "Order issue",
                "I need support",
                "Help with my purchase",
                "Customer service needed",
                "Can I get some help?",
                "I have a problem",
                "Can you assist with my order?",
                "I need help"
            ],
            "responses": [
                "Sure, I'm here to help! What seems to be the problem with your order?",
                "I'd be happy to assist you. Please provide more details about the issue.",
                "How can I help you with your purchase today?",
                "Please describe your issue, and I'll do my best to assist you.",
                "Our customer service team is here to help. What's the issue with your order?",
                "We are here to assist you. Can you provide more details on the problem?",
                "I'd be glad to help. What seems to be the problem with your order?",
                "Please let us know how we can assist you with your purchase.",
                "Can you describe the problem with your order? I'll assist you promptly.",
                "Customer service is here to help. Please provide details of your issue.",
                "What seems to be the problem with your purchase? I'm here to help.",
                "How can I assist you with your order issue today?",
                "I'd be happy to help. What problem are you experiencing with your purchase?",
                "Please explain the issue with your order, and I'll do my best to resolve it.",
                "Customer service is ready to assist you. What is the problem with your order?",
                "Let me know how I can assist you with your purchase issue.",
                "What help do you need with your order? I'm here to assist.",
                "How can I help with your order problem?",
                "What seems to be the issue with your order? I'll do my best to assist.",
                "Please describe your issue, and I will provide the necessary assistance."
            ]
        },
        {
            "tag": "store_hours",
            "patterns": [
                "What are your store hours?",
                "When are you open?",
                "Business hours",
                "Opening hours",
                "Store opening times",
                "What time do you close?",
                "When do you open?",
                "What are your working hours?",
                "Hours of operation",
                "Store hours today",
                "Opening and closing times",
                "Daily business hours",
                "What time do you open and close?",
                "When is the store open?",
                "Store operating hours",
                "Can you tell me your store hours?",
                "What are the hours of operation?",
                "Operating hours",
                "Store open hours",
                "Store timing"
            ],
            "responses": [
                "Our store hours are from 9 AM to 8 PM, Monday to Saturday.",
                "We are open from 9 AM to 8 PM on weekdays and Saturdays.",
                "Our business hours are 9 AM to 8 PM, Monday through Saturday.",
                "We operate from 9 AM to 8 PM, Monday to Saturday.",
                "The store is open from 9 AM to 8 PM, Monday to Saturday.",
                "Our opening hours are 9 AM to 8 PM, Monday to Saturday.",
                "We close at 8 PM and open at 9 AM, Monday through Saturday.",
                "Our working hours are from 9 AM to 8 PM, Monday to Saturday.",
                "Our hours of operation are 9 AM to 8 PM, Monday to Saturday.",
                "The store operates from 9 AM to 8 PM, Monday to Saturday.",
                "We are open daily from 9 AM to 8 PM except Sundays.",
                "Our daily business hours are 9 AM to 8 PM, Monday through Saturday.",
                "We open at 9 AM and close at 8 PM, Monday to Saturday.",
                "The store's operating hours are 9 AM to 8 PM, Monday to Saturday.",
                "You can visit us between 9 AM and 8 PM, Monday to Saturday.",
                "Our hours of operation are from 9 AM to 8 PM, Monday to Saturday.",
                "We are available from 9 AM to 8 PM, Monday to Saturday.",
                "Store hours are from 9 AM to 8 PM, Monday through Saturday.",
                "Our store timing is 9 AM to 8 PM, Monday to Saturday.",
                "We open at 9 AM and close at 8 PM, Monday to Saturday."
            ]
        },
        {
            "tag": "store_location",
            "patterns": [
                "Where is your store located?",
                "What is your address?",
                "Store location",
                "Address",
                "location",
                "Where can I find your store?",
                "What is your store address?",
                "Location of your store",
                "Can you give me the store address?",
                "Store location details",
                "Where are you located?",
                "What is the location of your store?",
                "Can you provide the store address?",
                "Where is your physical store?",
                "What is the address of your store?",
                "How can I find your store?",
                "Store address details",
                "Where is the store situated?",
                "Location details of the store",
                "Address of your store",
                "Where to find your store?"
            ],
            "responses": [
                "Our store is located at CeylonMart Furniture No.60 Kandy Rd,Radawadunna, Sri lanka",
                "You can find us at CeylonMart Furniture No.60 Kandy Rd,Radawadunna, Sri lanka",
                "We are located at CeylonMart Furniture No.60 Kandy Rd,Radawadunna, Sri lanka",
                "Our address is CeylonMart Furniture No.60 Kandy Rd,Radawadunna, Sri lanka",
                "The store address is CeylonMart Furniture No.60 Kandy Rd,Radawadunna, Sri lanka",
                "We are situated at CeylonMart Furniture No.60 Kandy Rd,Radawadunna, Sri lanka",
                "Visit us at CeylonMart Furniture No.60 Kandy Rd,Radawadunna, Sri lanka",
                "Our location is CeylonMart Furniture No.60 Kandy Rd,Radawadunna, Sri lanka",
                "The store is at CeylonMart Furniture No.60 Kandy Rd,Radawadunna, Sri lanka",
                "Our physical store is located at CeylonMart Furniture No.60 Kandy Rd,Radawadunna, Sri lanka",
                "You can find our store at CeylonMart Furniture No.60 Kandy Rd,Radawadunna, Sri lanka",
                "Our store address is CeylonMart Furniture No.60 Kandy Rd,Radawadunna, Sri lanka",
                "We are based at CeylonMart Furniture No.60 Kandy Rd,Radawadunna, Sri lanka",
                "The location of our store is 12CeylonMart3 Furniture No.60 Kandy Rd,Radawadunna, Sri lanka",
                "We are at CeylonMart Furniture No.60 Kandy Rd,Radawadunna, Sri lanka",
                "The address to visit our store is CeylonMart Furniture No.60 Kandy Rd,Radawadunna, Sri lanka",
                "You can visit us at CeylonMart Furniture No.60 Kandy Rd,Radawadunna, Sri lanka",
                "Our store is located at CeylonMart Furniture No.60 Kandy Rd,Radawadunna, Sri lanka",
                "We are located at CeylonMart Furniture No.60 Kandy Rd,Radawadunna, Sri lanka",
                "Our store address is CeylonMart Furniture No.60 Kandy Rd,Radawadunna, Sri lanka"
            ]
        },
        {
            "tag": "store_facilities",
            "patterns": [
                "What facilities does your store offer?",
                "Do you have parking?",
                "Is there wheelchair access?",
                "Do you have a café?",
                "What amenities are available at your store?",
                "Is there Wi-Fi available?",
                "What facilities are available?",
                "Are there restrooms in the store?",
                "Does your store have a kids' play area?",
                "What services are offered at the store?",
                "Are pets allowed in your store?",
                "Is there a customer lounge?",
                "What are the store amenities?",
                "Are there dressing rooms available?",
                "Do you offer gift wrapping services?",
                "Is there a personal shopper service?",
                "Do you have a loyalty program?",
                "Is there a delivery service?",
                "Do you provide installation services?",
                "Is there a repair service at the store?"
            ],
            "responses": [
                "Our store offers a variety of facilities including parking, wheelchair access, and a café.",
                "Yes, we have ample parking available for our customers.",
                "Our store is wheelchair accessible.",
                "We have a café where you can relax and enjoy some refreshments.",
                "Amenities available at our store include free Wi-Fi, restrooms, and a kids' play area.",
                "We provide free Wi-Fi for all our customers.",
                "Facilities available at our store include parking, wheelchair access, a café, and restrooms.",
                "There are restrooms available for customers in the store.",
                "Our store features a kids' play area to keep your children entertained while you shop.",
                "Services offered at our store include gift wrapping and a personal shopper service.",
                "Pets are welcome in our store as long as they are on a leash.",
                "We have a comfortable customer lounge for you to relax in.",
                "Store amenities include dressing rooms, gift wrapping services, and a customer lounge.",
                "We offer dressing rooms for you to try out our products.",
                "Our store provides gift wrapping services for your convenience.",
                "Yes, we have a personal shopper service to assist you with your purchases.",
                "Join our loyalty program to enjoy exclusive benefits and discounts.",
                "We offer a delivery service for your purchases.",
                "Installation services are available for certain products.",
                "Our store provides repair services for items purchased from us."
            ]
        },
        {
            "tag": "greeting",
            "patterns": [
                "Who are you",
                "Hello"
            ],
            "responses": [
                "I am CeylonMart chatBot",
                "I am a chatBot"              
            ]
        }



    ]
}
